#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```


Warning: Argument is deprecated

  with aws_api_gateway_deployment.deployment,
  on apigateway.tf line 193, in resource "aws_api_gateway_deployment" "deployment":
 193:   stage_name  = "dev"

The attribute "stage_name" will be removed in a future major version. Use an
explicit "aws_api_gateway_stage" instead.
Success! The configuration is valid, but there were some validation warnings
as shown above.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.archive_file.lambda_stop_package: Reading...
data.archive_file.lambda_package: Reading...
data.archive_file.lambda_package: Read complete after 0s [id=add2660100fde94410d1c552100036a8eae36446]
data.archive_file.lambda_stop_package: Read complete after 0s [id=7e10e15c20bde92cb0950226c51efcdc7865c8e5]
aws_api_gateway_rest_api.stop_ec2_gateway: Refreshing state... [id=1k9ub8vhk6]
aws_iam_user.nextjs_user: Refreshing state... [id=nextjs-access-user]
aws_iam_policy.lambda_policy: Refreshing state... [id=arn:aws:iam::117572128031:policy/lambda_policy]
aws_iam_role.lambda_role: Refreshing state... [id=lambda-role]
aws_iam_group.nextjs_access_group: Refreshing state... [id=nextjs-access-group]
aws_s3_bucket.transcript-bucket: Refreshing state... [id=transcript-bucket20231207181110470300000001]
aws_secretsmanager_secret.api_key: Refreshing state... [id=arn:aws:secretsmanager:eu-central-1:117572128031:secret:transcription_service_api_key-lOlyvY]
aws_iam_policy.stop_lambda_policy: Refreshing state... [id=arn:aws:iam::117572128031:policy/stop_lambda_policy]
aws_api_gateway_rest_api.transcription_gateway: Refreshing state... [id=hzjgd3yz9g]
aws_iam_group_policy_attachment.s3_access_attachment: Refreshing state... [id=nextjs-access-group-20250106183412668000000003]
aws_iam_group_policy_attachment.cloudwatch_access_attachment: Refreshing state... [id=nextjs-access-group-20250106183412653800000002]
aws_iam_user_group_membership.nextjs_user_membership: Refreshing state... [id=terraform-20250106183412629600000001]
aws_iam_role_policy_attachment.lambda_basic["arn:aws:iam::aws:policy/AmazonEC2FullAccess"]: Refreshing state... [id=lambda-role-20231209192723088800000001]
aws_iam_role_policy_attachment.lambda_basic["arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"]: Refreshing state... [id=lambda-role-20231209192723097600000002]
aws_lambda_function.start_lambda: Refreshing state... [id=startTranscriptionFunction]
aws_lambda_function.stop_lambda: Refreshing state... [id=stopEC2Function]
aws_secretsmanager_secret_version.api_key_version: Refreshing state... [id=arn:aws:secretsmanager:eu-central-1:117572128031:secret:transcription_service_api_key-lOlyvY|terraform-20250127171953510900000001]
aws_api_gateway_resource.stop_root: Refreshing state... [id=x1c8e2]
aws_api_gateway_resource.root: Refreshing state... [id=w3noxm]
aws_api_gateway_method.stop_proxy: Refreshing state... [id=agm-1k9ub8vhk6-x1c8e2-GET]
aws_api_gateway_method.options: Refreshing state... [id=agm-hzjgd3yz9g-w3noxm-OPTIONS]
aws_api_gateway_method.proxy: Refreshing state... [id=agm-hzjgd3yz9g-w3noxm-GET]
aws_api_gateway_method_response.stop_proxy: Refreshing state... [id=agmr-1k9ub8vhk6-x1c8e2-GET-200]
aws_api_gateway_method_response.options_response: Refreshing state... [id=agmr-hzjgd3yz9g-w3noxm-OPTIONS-200]
aws_api_gateway_integration.options_integration: Refreshing state... [id=agi-hzjgd3yz9g-w3noxm-OPTIONS]
aws_api_gateway_method_response.proxy: Refreshing state... [id=agmr-hzjgd3yz9g-w3noxm-GET-200]
aws_lambda_permission.stop_apigw_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
aws_api_gateway_integration.stop_lambda_integration: Refreshing state... [id=agi-1k9ub8vhk6-x1c8e2-GET]
aws_lambda_permission.apigw_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
aws_api_gateway_integration.lambda_integration: Refreshing state... [id=agi-hzjgd3yz9g-w3noxm-GET]
aws_api_gateway_integration_response.options_integration_response: Refreshing state... [id=agir-hzjgd3yz9g-w3noxm-OPTIONS-200]
aws_api_gateway_integration_response.stop_proxy: Refreshing state... [id=agir-1k9ub8vhk6-x1c8e2-GET-200]
aws_api_gateway_deployment.stop_deployment: Refreshing state... [id=f3wqgu]
aws_api_gateway_deployment.deployment: Refreshing state... [id=ey4o6i]
aws_api_gateway_integration_response.proxy: Refreshing state... [id=agir-hzjgd3yz9g-w3noxm-GET-200]
aws_api_gateway_stage.stop_dev: Refreshing state... [id=ags-1k9ub8vhk6-dev]
aws_s3_bucket_policy.transcript-bucket-policy: Refreshing state... [id=transcript-bucket20231207181110470300000001]
aws_s3_bucket_cors_configuration.transcript-bucket-cors: Refreshing state... [id=transcript-bucket20231207181110470300000001]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_api_gateway_integration.options_integration must be replaced
-/+ resource "aws_api_gateway_integration" "options_integration" {
      - cache_key_parameters    = [] -> null
      ~ cache_namespace         = "w3noxm" -> (known after apply)
      ~ id                      = "agi-hzjgd3yz9g-w3noxm-OPTIONS" -> (known after apply)
      + integration_http_method = "OPTIONS" # forces replacement
      ~ passthrough_behavior    = "WHEN_NO_MATCH" -> (known after apply)
      - request_parameters      = {} -> null
        # (7 unchanged attributes hidden)
    }

  # aws_api_gateway_integration_response.options_integration_response will be created
  + resource "aws_api_gateway_integration_response" "options_integration_response" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + resource_id         = "w3noxm"
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = "'Content-Type,X-Amz-Date,Authorization,X-Api-Key,X-Amz-Security-Token'"
          + "method.response.header.Access-Control-Allow-Methods" = "'GET,OPTIONS,POST,PUT'"
          + "method.response.header.Access-Control-Allow-Origin"  = "'*'"
        }
      + rest_api_id         = "hzjgd3yz9g"
      + status_code         = "200"
    }

  # aws_autoscaling_group.ton-texter-transcription-servers will be created
  + resource "aws_autoscaling_group" "ton-texter-transcription-servers" {
      + arn                              = (known after apply)
      + availability_zones               = (known after apply)
      + default_cooldown                 = (known after apply)
      + desired_capacity                 = 0
      + enabled_metrics                  = [
          + "GroupInServiceInstances",
          + "GroupTerminatingInstances",
          + "GroupTotalInstances",
        ]
      + force_delete                     = false
      + force_delete_warm_pool           = false
      + health_check_grace_period        = 300
      + health_check_type                = (known after apply)
      + id                               = (known after apply)
      + ignore_failed_scaling_activities = false
      + load_balancers                   = (known after apply)
      + max_size                         = 5
      + metrics_granularity              = "1Minute"
      + min_size                         = 0
      + name                             = "ton-texter-transcription-servers"
      + name_prefix                      = (known after apply)
      + predicted_capacity               = (known after apply)
      + protect_from_scale_in            = false
      + service_linked_role_arn          = (known after apply)
      + target_group_arns                = (known after apply)
      + vpc_zone_identifier              = (known after apply)
      + wait_for_capacity_timeout        = "10m"
      + warm_pool_size                   = (known after apply)

      + availability_zone_distribution {
          + capacity_distribution_strategy = (known after apply)
        }

      + launch_template {
          + id      = "unknown"
          + name    = "ton-texter-transcription-server"
          + version = "$Latest"
        }

      + mixed_instances_policy {
          + instances_distribution {
              + on_demand_allocation_strategy            = (known after apply)
              + on_demand_base_capacity                  = (known after apply)
              + on_demand_percentage_above_base_capacity = (known after apply)
              + spot_allocation_strategy                 = (known after apply)
              + spot_instance_pools                      = (known after apply)
              + spot_max_price                           = (known after apply)
            }

          + launch_template {
              + launch_template_specification {
                  + launch_template_id   = (known after apply)
                  + launch_template_name = (known after apply)
                  + version              = (known after apply)
                }

              + override {
                  + instance_type     = (known after apply)
                  + weighted_capacity = (known after apply)

                  + instance_requirements {
                      + accelerator_manufacturers                               = (known after apply)
                      + accelerator_names                                       = (known after apply)
                      + accelerator_types                                       = (known after apply)
                      + allowed_instance_types                                  = (known after apply)
                      + bare_metal                                              = (known after apply)
                      + burstable_performance                                   = (known after apply)
                      + cpu_manufacturers                                       = (known after apply)
                      + excluded_instance_types                                 = (known after apply)
                      + instance_generations                                    = (known after apply)
                      + local_storage                                           = (known after apply)
                      + local_storage_types                                     = (known after apply)
                      + max_spot_price_as_percentage_of_optimal_on_demand_price = (known after apply)
                      + on_demand_max_price_percentage_over_lowest_price        = (known after apply)
                      + require_hibernate_support                               = (known after apply)
                      + spot_max_price_percentage_over_lowest_price             = (known after apply)

                      + accelerator_count {
                          + max = (known after apply)
                          + min = (known after apply)
                        }

                      + accelerator_total_memory_mib {
                          + max = (known after apply)
                          + min = (known after apply)
                        }

                      + baseline_ebs_bandwidth_mbps {
                          + max = (known after apply)
                          + min = (known after apply)
                        }

                      + memory_gib_per_vcpu {
                          + max = (known after apply)
                          + min = (known after apply)
                        }

                      + memory_mib {
                          + max = (known after apply)
                          + min = (known after apply)
                        }

                      + network_bandwidth_gbps {
                          + max = (known after apply)
                          + min = (known after apply)
                        }

                      + network_interface_count {
                          + max = (known after apply)
                          + min = (known after apply)
                        }

                      + total_local_storage_gb {
                          + max = (known after apply)
                          + min = (known after apply)
                        }

                      + vcpu_count {
                          + max = (known after apply)
                          + min = (known after apply)
                        }
                    }

                  + launch_template_specification {
                      + launch_template_id   = (known after apply)
                      + launch_template_name = (known after apply)
                      + version              = (known after apply)
                    }
                }
            }
        }

      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "ton-texter-transcription-server"
        }

      + traffic_source {
          + identifier = (known after apply)
          + type       = (known after apply)
        }
    }

  # aws_lambda_function.start_lambda will be updated in-place
  ~ resource "aws_lambda_function" "start_lambda" {
        id                             = "startTranscriptionFunction"
        tags                           = {}
        # (23 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              + "ASG_ID"      = "ton-texter-transcription-servers"
              - "INSTANCE_ID" = "i-0dad893520b243dd5" -> null
                # (1 unchanged element hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

Plan: 3 to add, 1 to change, 1 to destroy.

Warning: Argument is deprecated

  with aws_api_gateway_deployment.deployment,
  on apigateway.tf line 193, in resource "aws_api_gateway_deployment" "deployment":
 193:   stage_name  = "dev"

The attribute "stage_name" will be removed in a future major version. Use an
explicit "aws_api_gateway_stage" instead.

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @ns144, Action: `pull_request`*